{"history_events":[{"event_title":"NORAD's Santa tracking service begins","event_desc":"The event is now a Christmas tradition where the North American Aerospace Defense Command tracks Santa Claus as he travels around the world delivering presents to children. The event began after a printing error in a Sears catalog asking children to call Santa Claus. The number that was printed was the number of Colorado Springs' Continental Air Defense Command (CONAD) Center.","year":1955},{"event_title":"Libya gains independence from Italy","event_desc":"The North African country had been ruled by Italy since 1912. After independence, it became a constitutional monarchy under King Idris. King Idris was overthrown in a military coup led by Muammar Gaddafi in 1969.","year":1951},{"event_title":"Christmas Truce begins","event_desc":"A much-studied event in war and peace studies, the Christmas Truce was a brief unofficial ceasefire between British and German troops  along the Western Front of World War I. During the truce, soldiers from both sides sang carols, shared food, exchanged gifts and played football (soccer). Subsequent attempts to hold similar ceasefires around Christmas time failed.","year":1914},{"event_title":"Ku Klux Klan created","event_desc":"The extremist white supremacist organization, also known as the Klan, was created in Pulaski, Tennessee by Confederate Army veterans.","year":1865},{"event_title":"Eggnog riots begin at the United States Military Academy in West Point, New York","event_desc":"Also known as the Grog Mutiny, these riots began on Christmas Eve after cadets consumed copious amounts of eggnog made with smuggled whiskey. The riots lasted until December 25.","year":1826}],"birthdays":[{"name":"Stephenie Meyer","about":"American author, film producer","year":1973},{"name":"Ricky Martin","about":"Puerto Rican/American singer-songwriter, actor","year":1971},{"name":"Hamid Karzai","about":"Afghan politician, 12th President of Afghanistan","year":1957},{"name":"Emanuel Lasker","about":"German chess player","year":1868},{"name":"John, King of England","about":"","year":1166}],"deaths":[{"name":"Harold Pinter","about":"English playwright, screenwriter, director, actor, Nobel Prize laureate","year":2008},{"name":"Samael Aun Weor","about":"Colombian author","year":1977},{"name":"William M. Branham","about":"American minister","year":1965},{"name":"John Muir","about":"Scottish/American environmentalist, author","year":1914},{"name":"Vasco da Gama","about":"Portuguese explorer","year":1524}]}
